cmsis-svd/cmsis-svd/data/Infineon/s6e1b8xg.svd
        <!-- REGISTER "LCDRAM00" -->
        <register>
          <name>LCDRAM00</name>
          <description>Display Data Memory Register 00</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM01" -->
        <register>
          <name>LCDRAM01</name>
          <description>Display Data Memory Register 01</description>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM02" -->
        <register>
          <name>LCDRAM02</name>
          <description>Display Data Memory Register 02</description>
          <addressOffset>0x1E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM03" -->
        <register>
          <name>LCDRAM03</name>
          <description>Display Data Memory Register 03</description>
          <addressOffset>0x1F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM04" -->
        <register>
          <name>LCDRAM04</name>
          <description>Display Data Memory Register 04</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM05" -->
        <register>
          <name>LCDRAM05</name>
          <description>Display Data Memory Register 05</description>
          <addressOffset>0x21</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM06" -->
        <register>
          <name>LCDRAM06</name>
          <description>Display Data Memory Register 06</description>
          <addressOffset>0x22</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM07" -->
        <register>
          <name>LCDRAM07</name>
          <description>Display Data Memory Register 07</description>
          <addressOffset>0x23</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM08" -->
        <register>
          <name>LCDRAM08</name>
          <description>Display Data Memory Register 08</description>
          <addressOffset>0x24</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM09" -->
        <register>
          <name>LCDRAM09</name>
          <description>Display Data Memory Register 09</description>
          <addressOffset>0x25</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM10" -->
        <register>
          <name>LCDRAM10</name>
          <description>Display Data Memory Register 10</description>
          <addressOffset>0x26</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM11" -->
        <register>
          <name>LCDRAM11</name>
          <description>Display Data Memory Register 11</description>
          <addressOffset>0x27</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM12" -->
        <register>
          <name>LCDRAM12</name>
          <description>Display Data Memory Register 12</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM13" -->
        <register>
          <name>LCDRAM13</name>
          <description>Display Data Memory Register 13</description>
          <addressOffset>0x29</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM14" -->
        <register>
          <name>LCDRAM14</name>
          <description>Display Data Memory Register 14</description>
          <addressOffset>0x2A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM15" -->
        <register>
          <name>LCDRAM15</name>
          <description>Display Data Memory Register 15</description>
          <addressOffset>0x2B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "LCDRAM16" -->
        <register>
          <name>LCDRAM16</name>
          <description>Display Data Memory Register 16</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
