cmsis-svd/cmsis-svd/data/Infineon/s6e1b8xg.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DS" -->
    <peripheral>
      <name>DS</name>
      <description>Low Power Consumption Mode Registers</description>
      <version>B</version>
      <groupName>DS</groupName>
      <baseAddress>0x40035100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x104</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x108</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x700</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x704</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x708</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x710</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x714</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x720</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x800</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x804</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x808</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "RCK_CTL" -->
        <register>
          <name>RCK_CTL</name>
          <description>Sub Clock Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CECCKE" -->
            <field>
              <name>CECCKE</name>
              <description>CEC clock control bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTCCKE" -->
            <field>
              <name>RTCCKE</name>
              <description>RTC clock control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "REG_CTL2" -->
        <register>
          <name>REG_CTL2</name>
          <description>Internal Voltage Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TT_SEL" -->
            <field>
              <name>TT_SEL</name>
              <description>Function enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TT_SVD" -->
            <field>
              <name>TT_SVD</name>
              <description>Internalvoltage setting bit</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MOSC_CTL" -->
        <register>
          <name>MOSC_CTL</name>
          <description>Main Oscillation Crystal Type Selection Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x06</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IMAINSEL" -->
            <field>
              <name>IMAINSEL</name>
              <description>Main oscillation circuit current setting bits</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CAL_CTL" -->
        <register>
          <name>CAL_CTL</name>
          <description>Vref Calibration Control Register</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x08</resetValue>
          <resetMask>0x0D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CALDONE" -->
            <field>
              <name>CALDONE</name>
              <description>Vref Calibration Done Flag</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BGRSEL" -->
            <field>
              <name>BGRSEL</name>
              <description>Vref Select Bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CALSTART" -->
            <field>
              <name>CALSTART</name>
              <description>Vref Calibration Start Bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CAL_SET" -->
        <register>
          <name>CAL_SET</name>
          <description>Vref Calibration Value Register</description>
          <addressOffset>0x104</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x11</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DSTB" -->
            <field>
              <name>DSTB</name>
              <description>Vref Calibration Value</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CAL_KEY" -->
        <register>
          <name>CAL_KEY</name>
          <description>Vref Calibration Security Key Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PMD_CTL" -->
        <register>
          <name>PMD_CTL</name>
          <description>RTC Mode Control Register</description>
          <addressOffset>0x700</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCE" -->
            <field>
              <name>RTCE</name>
              <description>RTC mode control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WRFSR" -->
        <register>
          <name>WRFSR</name>
          <description>Deep Standby Return Factor Register 1</description>
          <addressOffset>0x704</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WLVDH" -->
            <field>
              <name>WLVDH</name>
              <description>Low-voltage detection reset return bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WINITX" -->
            <field>
              <name>WINITX</name>
              <description>INITX pin input reset return bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WIFSR" -->
        <register>
          <name>WIFSR</name>
          <description>Deep Standby Return Factor Register 2</description>
          <addressOffset>0x708</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI11" -->
            <field>
              <name>WUI11</name>
              <description>WKUP11 pin input return bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI10" -->
            <field>
              <name>WUI10</name>
              <description>WKUP10 pin input return bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI9" -->
            <field>
              <name>WUI9</name>
              <description>WKUP9 pin input return bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI8" -->
            <field>
              <name>WUI8</name>
              <description>WKUP8 pin input return bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI7" -->
            <field>
              <name>WUI7</name>
              <description>WKUP7 pin input return bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI6" -->
            <field>
              <name>WUI6</name>
              <description>WKUP6 pin input return bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WCEC1I" -->
            <field>
              <name>WCEC1I</name>
              <description>CEC ch.1 interrupt return bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WCEC0I" -->
            <field>
              <name>WCEC0I</name>
              <description>CEC ch.0 interrupt return bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI5" -->
            <field>
              <name>WUI5</name>
              <description>WKUP5 pin input return bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI4" -->
            <field>
              <name>WUI4</name>
              <description>WKUP4 pin input return bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI3" -->
            <field>
              <name>WUI3</name>
              <description>WKUP3 pin input return bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI2" -->
            <field>
              <name>WUI2</name>
              <description>WKUP2 pin input return bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI1" -->
            <field>
              <name>WUI1</name>
              <description>WKUP1 pin input return bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI0" -->
            <field>
              <name>WUI0</name>
              <description>WKUP0 pin input return bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WLVDI" -->
            <field>
              <name>WLVDI</name>
              <description>LVD interrupt return bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WRTCI" -->
            <field>
              <name>WRTCI</name>
              <description>RTC interrupt return bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
