cmsis-svd/cmsis-svd/data/Infineon/s6e1b8xg.svd
        <!-- REGISTER "WTTR0" -->
        <register>
          <name>WTTR0</name>
          <description>Timer Setting Register 0</description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM7" -->
            <field>
              <name>TM7</name>
              <description>Timer Setting Register</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM6" -->
            <field>
              <name>TM6</name>
              <description>Timer Setting Register</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM5" -->
            <field>
              <name>TM5</name>
              <description>Timer Setting Register</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM4" -->
            <field>
              <name>TM4</name>
              <description>Timer Setting Register</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM3" -->
            <field>
              <name>TM3</name>
              <description>Timer Setting Register</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM2" -->
            <field>
              <name>TM2</name>
              <description>Timer Setting Register</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM1" -->
            <field>
              <name>TM1</name>
              <description>Timer Setting Register</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM0" -->
            <field>
              <name>TM0</name>
              <description>Timer Setting Register</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR1" -->
        <register>
          <name>WTTR1</name>
          <description>Timer Setting Register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM15" -->
            <field>
              <name>TM15</name>
              <description>Timer Setting Register</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM14" -->
            <field>
              <name>TM14</name>
              <description>Timer Setting Register</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM13" -->
            <field>
              <name>TM13</name>
              <description>Timer Setting Register</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM12" -->
            <field>
              <name>TM12</name>
              <description>Timer Setting Register</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM11" -->
            <field>
              <name>TM11</name>
              <description>Timer Setting Register</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM10" -->
            <field>
              <name>TM10</name>
              <description>Timer Setting Register</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM9" -->
            <field>
              <name>TM9</name>
              <description>Timer Setting Register</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM8" -->
            <field>
              <name>TM8</name>
              <description>Timer Setting Register</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR2" -->
        <register>
          <name>WTTR2</name>
          <description>Timer Setting Register 2</description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM17" -->
            <field>
              <name>TM17</name>
              <description>Timer Setting Register</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TM16" -->
            <field>
              <name>TM16</name>
              <description>Timer Setting Register</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCAL0" -->
        <register>
          <name>WTCAL0</name>
          <description>Frequency Correction Value Setting Register 0</description>
          <addressOffset>0x58</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
