cmsis-svd/cmsis-svd/data/Infineon/s6e1b8xg.svd
        <!-- REGISTER "VIR15" -->
        <register>
          <name>VIR15</name>
          <description>Vector Indicate Register 15</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR16" -->
        <register>
          <name>VIR16</name>
          <description>Vector Indicate Register 16</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR17" -->
        <register>
          <name>VIR17</name>
          <description>Vector Indicate Register 17</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR18" -->
        <register>
          <name>VIR18</name>
          <description>Vector Indicate Register 18</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR19" -->
        <register>
          <name>VIR19</name>
          <description>Vector Indicate Register 19</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR20" -->
        <register>
          <name>VIR20</name>
          <description>Vector Indicate Register 20</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR21" -->
        <register>
          <name>VIR21</name>
          <description>Vector Indicate Register 21</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR22" -->
        <register>
          <name>VIR22</name>
          <description>Vector Indicate Register 22</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR23" -->
        <register>
          <name>VIR23</name>
          <description>Vector Indicate Register 23</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR24" -->
        <register>
          <name>VIR24</name>
          <description>Vector Indicate Register 24</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR25" -->
        <register>
          <name>VIR25</name>
          <description>Vector Indicate Register 25</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR26" -->
        <register>
          <name>VIR26</name>
          <description>Vector Indicate Register 26</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR27" -->
        <register>
          <name>VIR27</name>
          <description>Vector Indicate Register 27</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR28" -->
        <register>
          <name>VIR28</name>
          <description>Vector Indicate Register 28</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR29" -->
        <register>
          <name>VIR29</name>
          <description>Vector Indicate Register 29</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR30" -->
        <register>
          <name>VIR30</name>
          <description>Vector Indicate Register 30</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "VIR31" -->
        <register>
          <name>VIR31</name>
          <description>Vector Indicate Register 31</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
